espressif/arduino-esp32/libraries/BLE/src/BLEAdvertising.cpp
void BLEAdvertising::reset() {
  if (BLEDevice::getInitialized()) {
    stop();
  }

  memset(&m_scanRespData, 0, sizeof(esp_ble_adv_data_t));
  memset(&m_advData, 0, sizeof(esp_ble_adv_data_t));
  memset(&m_advParams, 0, sizeof(esp_ble_adv_params_t));

  m_advData.set_scan_rsp = false;
  m_advData.include_name = true;
  m_advData.include_txpower = true;
  m_advData.min_interval = 0x20;
  m_advData.max_interval = 0x40;
  m_advData.appearance = 0x00;
  m_advData.manufacturer_len = 0;
  m_advData.p_manufacturer_data = nullptr;
  m_advData.service_data_len = 0;
  m_advData.p_service_data = nullptr;
  m_advData.service_uuid_len = 0;
  m_advData.p_service_uuid = nullptr;
  m_advData.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);

  m_advParams.adv_int_min = 0x20;
  m_advParams.adv_int_max = 0x40;
  m_advParams.adv_type = ADV_TYPE_IND;
  m_advParams.own_addr_type = BLE_ADDR_TYPE_PUBLIC;
  m_advParams.channel_map = ADV_CHNL_ALL;
  m_advParams.adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY;
  m_advParams.peer_addr_type = BLE_ADDR_TYPE_PUBLIC;

  m_customAdvData = false;           // No custom advertising data
  m_customScanResponseData = false;  // No custom scan response data
  m_advDataSet = false;              // Force advertising data reconfiguration
  m_advConfiguring = false;          // Not currently configuring
  m_nameInScanResp = false;          // Name placement decided fresh on each start()
  m_advertisingPending = false;      // No pending advertising start
}  // BLEAdvertising

void BLEAdvertising::freeServiceUUIDs() {
  free(m_advData.p_service_uuid);
  m_advData.p_service_uuid = nullptr;
  m_advData.service_uuid_len = 0;
}

/**
 * @brief Build raw scan response data bytes containing TX power and, when the
 *        device name overflowed the advertising packet, the device name.
 *
 * TX power is encoded first (always 3 bytes). The device name is appended only
 * when @ref m_nameInScanResp is true (i.e. the name did not fit in the
 * advertising packet). This mirrors NimBLE's behavior: the name stays in the
 * advertising packet when there is room for it there, and is moved to the scan
 * response only when the advertising payload is already full.
 *
 * @param [out] buf    Destination buffer; at most ESP_BLE_ADV_DATA_LEN_MAX bytes
 *                     will be written.
 * @param [in]  bufLen Size of buf; clamped to ESP_BLE_ADV_DATA_LEN_MAX.
 * @return Number of bytes written.
 */
uint16_t BLEAdvertising::buildRawScanRespData(uint8_t *buf, uint16_t bufLen) {
  uint8_t *p = buf;
  uint16_t remaining = (bufLen < ESP_BLE_ADV_DATA_LEN_MAX) ? bufLen : ESP_BLE_ADV_DATA_LEN_MAX;

  // --- TX power level ---
  if (remaining >= 3) {
    *p++ = 2;
    *p++ = ESP_BLE_AD_TYPE_TX_PWR;
    *p++ = (uint8_t)BLEDevice::getPower();
    remaining -= 3;
  }

  // --- Device name (only when it overflowed the advertising packet) ---
  // Mirrors NimBLE: name stays in the adv packet when it fits there; only
  // moved here when the adv payload was already full.
  if (m_nameInScanResp) {
    String deviceName = BLEDevice::getDeviceName();
    uint16_t nameLen = deviceName.length();
    if (nameLen > 0 && remaining >= 3) {
      uint16_t maxChars = remaining - 2;
      bool complete = (nameLen <= maxChars);
      uint16_t actualLen = complete ? nameLen : maxChars;
      *p++ = actualLen + 1;
      *p++ = complete ? ESP_BLE_AD_TYPE_NAME_CMPL : ESP_BLE_AD_TYPE_NAME_SHORT;
      memcpy(p, deviceName.c_str(), actualLen);
      p += actualLen;
      remaining -= 2 + actualLen;
    }
  }

  return (uint16_t)(p - buf);
}

bool BLEAdvertising::configureScanResponseData() {
  // Build a compact raw scan response carrying TX power and, when the device
  // name overflowed the advertising packet (m_nameInScanResp == true), the
  // device name. Service UUIDs are never duplicated here — they are already
  // encoded in the advertising packet.
  // This mirrors NimBLE's behavior: the name only moves to the scan response
  // when the advertising payload was too full to accommodate it.
  uint8_t rawBuf[ESP_BLE_ADV_DATA_LEN_MAX];
  uint16_t rawLen = buildRawScanRespData(rawBuf, sizeof(rawBuf));
  esp_err_t errRc = ::esp_ble_gap_config_scan_rsp_data_raw(rawBuf, rawLen);
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_config_scan_rsp_data_raw: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }
  return true;
}

/**
 * @brief Build raw advertising data bytes with fields encoded in their native sizes.
 *
 * Used for all advertising (both with and without scan response). Fields are
 * written in priority order: flags, service UUIDs (16/32/128-bit in native
 * sizes), appearance, manufacturer data, service data, and optionally the
 * device name. TX power and connection interval are intentionally omitted from
 * the advertising packet to maximize space; TX power is placed in the scan
 * response when scan response is enabled. If the full name does not fit, it is
 * truncated and the AD type is set to Shortened Local Name (0x08).
 *
 * Encoding UUIDs in their native sizes (rather than expanding all to 128-bit as
 * the Bluedroid structured API does) maximizes the available advertising payload.
 *
 * @param [out] buf         Destination buffer; at most ESP_BLE_ADV_DATA_LEN_MAX
 *                          bytes will be written.
 * @param [in]  bufLen      Size of buf; clamped to ESP_BLE_ADV_DATA_LEN_MAX.
 * @param [in]  includeName Whether to append the device name. Pass false when
 *                          the name will be carried in the scan response.
 * @return Number of bytes written.
 */
uint16_t BLEAdvertising::buildRawAdvData(uint8_t *buf, uint16_t bufLen, bool includeName) {
  uint8_t *p = buf;
  uint16_t remaining = (bufLen < ESP_BLE_ADV_DATA_LEN_MAX) ? bufLen : ESP_BLE_ADV_DATA_LEN_MAX;

  // --- Flags ---
  if (m_advData.flag != 0 && remaining >= 3) {
    *p++ = 2;
    *p++ = ESP_BLE_AD_TYPE_FLAG;
    *p++ = m_advData.flag;
    remaining -= 3;
  }

  // --- Service UUIDs (grouped by size) ---
  // 16-bit
  {
    uint8_t *hdr = nullptr;
    bool hasMore16 = false;
    for (auto &uuid : m_serviceUUIDs) {
      if (uuid.getNative()->len == ESP_UUID_LEN_16) {
        if (remaining >= (hdr ? 2u : 4u)) {
          if (!hdr) {
            hdr = p;
            *p++ = 1;
            *p++ = ESP_BLE_AD_TYPE_16SRV_CMPL;
            remaining -= 2;
          }
          uint16_t val = uuid.getNative()->uuid.uuid16;
          *p++ = val & 0xFF;
          *p++ = (val >> 8) & 0xFF;
          remaining -= 2;
          *hdr += 2;
        } else {
          hasMore16 = true;
        }
      }
    }
    if (hdr != nullptr && hasMore16) {
      *(hdr + 1) = ESP_BLE_AD_TYPE_16SRV_PART;
    }
  }
  // 32-bit
  {
    uint16_t num32 = 0;
    for (auto &uuid : m_serviceUUIDs) {
      if (uuid.getNative()->len == ESP_UUID_LEN_32) {
        ++num32;
      }
    }
    bool allFit32 = (num32 == 0) || (remaining >= 2u + 4u * num32);
    uint8_t *hdr = nullptr;
    for (auto &uuid : m_serviceUUIDs) {
      if (uuid.getNative()->len == ESP_UUID_LEN_32 && remaining >= (hdr ? 4u : 6u)) {
        if (!hdr) {
          hdr = p;
          *p++ = 1;
          *p++ = allFit32 ? ESP_BLE_AD_TYPE_32SRV_CMPL : ESP_BLE_AD_TYPE_32SRV_PART;
          remaining -= 2;
        }
        uint32_t val = uuid.getNative()->uuid.uuid32;
        *p++ = val & 0xFF;
        *p++ = (val >> 8) & 0xFF;
        *p++ = (val >> 16) & 0xFF;
        *p++ = (val >> 24) & 0xFF;
        remaining -= 4;
        *hdr += 4;
      }
    }
  }
  // 128-bit (at most one in a legacy advertising PDU)
  {
    size_t num128 = 0;
    for (auto &uuid : m_serviceUUIDs) {
      if (uuid.getNative()->len == ESP_UUID_LEN_128) {
        ++num128;
      }
    }
    for (auto &uuid : m_serviceUUIDs) {
      if (uuid.getNative()->len == ESP_UUID_LEN_128 && remaining >= 18) {
        *p++ = 17;
        *p++ = (num128 == 1) ? ESP_BLE_AD_TYPE_128SRV_CMPL : ESP_BLE_AD_TYPE_128SRV_PART;
        memcpy(p, uuid.getNative()->uuid.uuid128, 16);
        p += 16;
        remaining -= 18;
        break;
      }
    }
  }

  // --- Appearance ---
  if (m_advData.appearance != 0 && remaining >= 4) {
    *p++ = 3;
    *p++ = ESP_BLE_AD_TYPE_APPEARANCE;
    *p++ = m_advData.appearance & 0xFF;
    *p++ = (m_advData.appearance >> 8) & 0xFF;
    remaining -= 4;
  }

